# Taps
# tap "ethereum/ethereum"
tap "exoscale/tap"
tap "github/gh"
tap "gromgit/fuse"
tap "homebrew/bundle"
tap "homebrew/cask-versions"
tap "teamookla/speedtest"
tap "warrensbox/tap"

tap 'homebrew/bundle'

# Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg' # Audio conversion
brew 'gh'
brew 'git'
brew 'grep'
brew 'httpie'
brew 'jq'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'svn' # Needed to install fonts
brew 'zsh-autocomplete'

# DevOps
brew "argocd"
brew "chart-testing"
brew "git-crypt"
brew "go"
brew "grep"
brew "helm"
brew "hugo"
brew "ipfs"
brew "jq"
brew "kubeconform"
brew "kubectx"
brew "kubeseal"
brew "okta-aws-cli"
brew "opentofu"
brew "parallel"
brew "pass"
brew "pinentry-mac"
brew "pre-commit"
brew "solidity", link: false
brew "tailscale"
brew "terraform"
brew "terraform-docs"
brew "terragrunt"
brew "tflint"
brew "tfsec"
brew "yamale"
brew "yamllint"
brew "ykman"

# brew "exoscale/tap/exoscale-cli"
brew "warrensbox/tap/tfswitch"

# Spatie Medialibrary
# brew 'jpegoptim'
# brew 'optipng'
# brew 'pngquant'
# brew 'svgo'
# brew 'gifsicle'

# Development
# brew 'imagemagick'
brew 'yarn'

# Apps
cask '1password'
cask 'bitwarden'
# cask 'discord'
cask 'docker'
cask 'figma'
cask 'firefox'
cask 'github'
cask 'google-chrome'
cask 'httpie'
cask 'imageoptim'
cask 'slack'
cask 'spotify'
# cask 'telegram-desktop'
cask 'the-unarchiver'
cask 'visual-studio-code'
cask 'zoom'

# Quicklook
cask 'qlmarkdown'
cask 'quicklook-json'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
mas 'Giphy Capture', id: 668208984
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
mas 'Speedtest', id: 1153157709

# VSCode
vscode "aaron-bond.better-comments"
vscode "coder.coder-remote"
vscode "enkia.enki-vscode-theme"
vscode "esbenp.prettier-vscode"
vscode "github.vscode-github-actions"
vscode "hashicorp.terraform"
vscode "jebbs.plantuml"
vscode "me-dutour-mathieu.vscode-github-actions"
vscode "monokai.theme-monokai-pro-vscode"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "mvllow.rose-pine"
vscode "redhat.vscode-yaml"
vscode "shakram02.bash-beautify"
vscode "simonsiefke.prettier-vscode"
vscode "tim-koehler.helm-intellisense"
vscode "tintinweb.graphviz-interactive-preview"
vscode "tintinweb.solidity-visual-auditor"
vscode "tintinweb.vscode-ethover"
vscode "tintinweb.vscode-inline-bookmarks"
vscode "tintinweb.vscode-solidity-flattener"
vscode "tintinweb.vscode-solidity-language"
vscode "zhuangtongfa.material-theme"